// pages/schedule/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    "第1周": {
      "星期一": {
        "[01-02]节": {
          "课程学分": "2",
          "课程属性": "必修课",
          "课程名称": "思想道德修养与法律基础（含廉洁修身）II",
          "上课时间": "第1周 星期一 [01-02]节",
          "上课地点": "综405"
        }
      },
      "星期二": {
        "[01-02]节": {
          "课程学分": "3",
          "课程属性": "必修课",
          "课程名称": "Java程序设计",
          "上课时间": "第1周 星期二 [01-02]节",
          "上课地点": "教302"
        },
        "[03-04]节": {
          "课程学分": "3",
          "课程属性": "必修课",
          "课程名称": "web前端页面开发",
          "上课时间": "第1周 星期二 [03-04]节",
          "上课地点": "教303"
        }
      },
      "星期三": {
        "[01-02]节": {
          "课程学分": "1.5",
          "课程属性": "选修课",
          "课程名称": "人工智能基础",
          "上课时间": "第1周 星期三 [01-02]节",
          "上课地点": "实303"
        },
        "[03-04]节": {
          "课程学分": "2",
          "课程属性": "必修课",
          "课程名称": "体育II（天河气排球030304）",
          "上课时间": "第1周 星期三 [03-04]节",
          "上课地点": "羽毛球馆",
          "分组名": "天河气排球030304"
        }
      },
      "星期四": {
        "[01-02]节": {
          "课程学分": "3",
          "课程属性": "必修课",
          "课程名称": "Java程序设计",
          "上课时间": "第1周 星期四 [01-02]节",
          "上课地点": "实303"
        },
        "[03-04]节": {
          "课程学分": "3",
          "课程属性": "必修课",
          "课程名称": "Linux操作系统",
          "上课时间": "第1周 星期四 [03-04]节",
          "上课地点": "实402"
        }
      },
      "星期五": {
        "[03-04]节": {
          "课程学分": "3",
          "课程属性": "必修课",
          "课程名称": "web前端页面开发",
          "上课时间": "第1周 星期五 [03-04]节",
          "上课地点": "实703"
        },
        "[05-06]节": {
          "课程学分": "3",
          "课程属性": "必修课",
          "课程名称": "Linux操作系统",
          "上课时间": "第1周 星期五 [05-06]节",
          "上课地点": "实401"
        },
        "[07-08]节": {
          "课程学分": "2",
          "课程属性": "必修课",
          "课程名称": "线性代数",
          "上课时间": "第1周 星期五 [07-08]节",
          "上课地点": "教103"
        }
      },
      "date": "2022-02-27"
    }
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})